Revit 2027 API
ExtendedPropertiesLinkData Properties
The ExtendedPropertiesLinkData type exposes the following members.
Properties
Name | Description
ContainerName |  The extended properties container name used as a custom group in the properties palette.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Region |  The region of the account that contains the parameter definitions.
Top
See Also
Reference
ExtendedPropertiesLinkData Class
Autodesk.Revit.DB.ExternalData Namespace